phucttp/sd-flash-esp32/main/flasher/flasher_esp.cpp
/**
 * @file flasher_esp.cpp
 * @brief Engine nạp firmware cho mục tiêu ESP32 qua giao tiếp UART.
 *
 * Chức năng chính:
 *   - Thiết lập kết nối với bootloader ROM của ESP32 target (handshake qua esp_loader)
 *   - Hỗ trợ nạp cả firmware thường (.bin) và firmware mã hóa (.enc) — giải mã AES trước khi nạp
 *   - Nạp tuần tự 3 phân vùng: bootloader, partition table, application
 *   - Xác thực từng phân vùng sau nạp bằng MD5 checksum
 *   - Hỗ trợ xóa toàn bộ chip (chip erase) độc lập với quá trình nạp
 */

// ============================================================
// 1. STANDARD & ESP-IDF LIBRARIES
// ============================================================
#include "flasher_esp.h" // ESP32 UART flasher definitions
#include "flasher_esp_crypto.h" // AES decryption for encrypted firmware

#include <inttypes.h> // Hỗ trợ định dạng PRIx32
#include <string.h>
#include "esp_err.h"
#include "esp_log.h"
#include "esp_system.h"
#include "driver/uart.h"
#include "driver/gpio.h"

// ============================================================
// 2. ESP-SERIAL-FLASHER LIBRARIES
// ============================================================
#include "esp32_port.h" 	 // Cấu hình cổng UART và GPIO cho esp_loader
#include "esp_loader.h" 	 // Các hàm API cấp cao của bootloader ROM

// ============================================================
// 3. PROJECT LIBRARIES (ARDUINO & OTHERS)
// ============================================================
#include "FS.h"
#include "SD.h"
#include "Arduino.h"
#include "oled_ui.h"         // OledUI Library

// Extern UI instance from main.cpp
extern OledUI ui;

// TAG dùng để lọc log cho module này
static const char *TAG = "FLASHER";

// File lưu boot combo config trên SD
#define BOOT_CONFIG_PATH "/config/boot.txt"

// Cached saved combo (load 1 lần từ SD)
static int g_saved_combo = -1;
static bool g_combo_loaded = false;

/**
 * @brief Khởi tạo phần cứng của HOST (ESP32-C3) để giao tiếp với TARGET.
 * Hàm này cài đặt các chân UART (TX/RX) và các chân điều khiển
 * (RTS/DTR) để thư viện esp_loader có thể nói chuyện được với target.
 * CHẠY 1 LẦN DUY NHẤT lúc khởi động.
 */
// Cấu hình các chân GPIO và cổng UART mà HOST sẽ dùng
const loader_esp32_config_t config = {
	.baud_rate = 115200, 	 	 // Tốc độ baud giao tiếp ban đầu
	.uart_port = UART_NUM_1, 	 // Dùng UART1 của con HOST (ESP32-C3)
	.uart_rx_pin = FLASH_UART_RX_PIN, 	 // Chân RX của HOST (nối với TX của Target)
	.uart_tx_pin = FLASH_UART_TX_PIN, 	 // Chân TX của HOST (nối với RX của Target)
	.reset_trigger_pin = FLASH_RESET_PIN, // Chân HOST điều khiển chân EN/RESET của Target
	.gpio0_trigger_pin = FLASH_BOOT_PIN, // Chân HOST điều khiển chân BOOT/GPIO0 của Target
};

// Khai báo hàm
static esp_err_t try_connect(void);

// Flag để tránh init UART nhiều lần
static bool g_flasher_initialized = false;

/**
 * @brief Khởi tạo giao tiếp UART và cổng nạp.
 * @return ESP_OK nếu thành công, ESP_FAIL nếu thất bại.
 */
esp_err_t flasher_init() {
	// Skip nếu đã init rồi
	if (g_flasher_initialized) {
		ESP_LOGI(TAG, "Flasher already initialized, skipping...");
		return ESP_OK;
	}

	ESP_LOGI(TAG, "Initializing UART connection for flasher...");
	// Khởi tạo UART và cấu hình GPIO theo `config` cho thư viện esp_loader
	if (loader_port_esp32_init(&config) != ESP_LOADER_SUCCESS) {
		ESP_LOGE(TAG, "serial initialization failed.");
		return ESP_FAIL;
	}

	g_flasher_initialized = true;
	ESP_LOGI(TAG, "UART connection initialized at baud rate 115200");
	return ESP_OK;
}

/**
 * @brief Ghi một phân vùng (segment) của firmware lên chip Target.
 * @param file_path Đường dẫn file binary trên thẻ nhớ SD.
 * @param offset Địa chỉ flash bắt đầu ghi.
 * @param md5 Chuỗi MD5 (32 ký tự) để xác thực sau khi ghi.
 * @return ESP_OK nếu ghi và xác thực thành công.
 */
esp_err_t flasher_write_segment(const std::string& file_path, uint32_t offset, const std::string& md5)
{
	ESP_LOGI(TAG, "==== Writing segment ====");
	ESP_LOGI(TAG, "File: %s | Offset: 0x%08" PRIx32, file_path.c_str(), offset);

	// --- MỞ FILE ---
	File fwFile = SD.open(file_path.c_str(), FILE_READ);
	if (!fwFile) {
		ESP_LOGE(TAG, "Failed to open file: %s", file_path.c_str());
		return ESP_ERR_NOT_FOUND;
	}

	size_t total_size = fwFile.size();
	if (total_size == 0) {
		ESP_LOGE(TAG, "File is empty: %s", file_path.c_str());
		fwFile.close();
		return ESP_FAIL;
	}

	ESP_LOGI(TAG, "Segment size: %zu bytes", total_size);

	// --- BẮT ĐẦU GHI FLASH ---
	// Gửi lệnh báo cho target biết sắp ghi phân vùng tại offset, kích thước total_size, và kích thước buffer
	esp_loader_error_t err = esp_loader_flash_start(offset, total_size, FLASHER_BUFFER_SIZE);
	if (err != ESP_LOADER_SUCCESS) {
		ESP_LOGE(TAG, "Failed to start flash for segment. err=%d", err);
		fwFile.close();
		return ESP_FAIL;
	}

	// Cấp phát bộ đệm để đọc dữ liệu từ SD và truyền qua UART
	uint8_t* buffer = (uint8_t*) malloc(FLASHER_BUFFER_SIZE);
	if (!buffer) {
		ESP_LOGE(TAG, "Failed to allocate buffer!");
		fwFile.close();
		return ESP_ERR_NO_MEM;
	}

	size_t bytes_written = 0;
	size_t bytes_read = 0;

	// Đọc từng khối dữ liệu từ file và ghi vào flash của Target
	while ((bytes_read = fwFile.read(buffer, FLASHER_BUFFER_SIZE)) > 0) {
		// Ghi khối dữ liệu vào flash
		err = esp_loader_flash_write(buffer, bytes_read);
		if (err != ESP_LOADER_SUCCESS) {
			ESP_LOGE(TAG, "Write error at offset %zu (err=%d)", bytes_written, err);
			free(buffer);
			fwFile.close();
			return ESP_FAIL;
		}

		bytes_written += bytes_read;
		// Tính toán và hiển thị tiến trình nạp
		uint32_t progress = (uint32_t)((bytes_written * 100) / total_size);

		// Cập nhật progress bar (mỗi 2% để giảm flicker)
		static uint32_t last_progress = 0;
		if (progress != last_progress && progress % 10 == 0) {
			last_progress = progress;
			ESP_LOGI(TAG, "Progress: %" PRIu32 "%%", progress);
			// Hiển thị progress bar thay vì text
			ui.showProgress(file_path.c_str(), (int)progress);
		}
	}

	free(buffer);
	fwFile.close();

	ESP_LOGI(TAG, "Segment written %zu / %zu bytes OK", bytes_written, total_size);

