phucttp/sd-flash-esp32/main/flasher/flasher_esp.cpp
	// --- KIỂM TRA MD5 (NẾU CÓ) ---
	if (md5.length() == 32) {
		char md5_ascii[33];
		// Sao chép chuỗi MD5 vào buffer và đảm bảo kết thúc bằng null
		strncpy(md5_ascii, md5.c_str(), 32);
		md5_ascii[32] = '\0';

		// Gửi lệnh MD5 để target tính toán và xác thực dữ liệu vừa ghi
		err = esp_loader_flash_verify_known_md5(offset, total_size, (const uint8_t*) md5_ascii);
		if (err != ESP_LOADER_SUCCESS) {
			ESP_LOGE(TAG, "MD5 check failed for segment!");
			return ESP_FAIL;
		}

		ESP_LOGI(TAG, "MD5 verified OK for segment!");
	} else {
		ESP_LOGW(TAG, "No valid MD5 provided, skipping verification.");
	}

	ESP_LOGI(TAG, "Segment at 0x%08" PRIx32 " written successfully.", offset);
	return ESP_OK;
}

/**
 * @brief Ghi một phân vùng MÃ HÓA của firmware lên chip Target.
 * @param file_path Đường dẫn file .enc trên thẻ nhớ SD.
 * @param offset Địa chỉ flash bắt đầu ghi.
 * @param md5 Chuỗi MD5 (32 ký tự) để xác thực sau khi ghi.
 * @return ESP_OK nếu ghi và xác thực thành công.
 */
esp_err_t flasher_write_segment_encrypted(const std::string& file_path, uint32_t offset, const std::string& md5)
{
	ESP_LOGI(TAG, "==== Writing ENCRYPTED segment ====");
	ESP_LOGI(TAG, "File: %s | Offset: 0x%08" PRIx32, file_path.c_str(), offset);

	// --- MỞ FILE MÃ HÓA ---
	File fwFile = SD.open(file_path.c_str(), FILE_READ);
	if (!fwFile) {
		ESP_LOGE(TAG, "Failed to open encrypted file: %s", file_path.c_str());
		return ESP_ERR_NOT_FOUND;
	}

	size_t total_size = fwFile.size();
	if (total_size == 0) {
		ESP_LOGE(TAG, "Encrypted file is empty: %s", file_path.c_str());
		fwFile.close();
		return ESP_FAIL;
	}

	ESP_LOGI(TAG, "Encrypted file size: %zu bytes", total_size);

	// --- KHỞI TẠO CRYPTO ---
	flasher_crypto_ctx_t crypto = {0};
	if (flasher_crypto_init(&crypto) != ESP_OK) {
		ESP_LOGE(TAG, "Failed to initialize crypto context");
		fwFile.close();
		return ESP_FAIL;
	}

	// --- BẮT ĐẦU GHI FLASH ---
	// Gửi lệnh báo cho target biết sắp ghi phân vùng
	// Lưu ý: total_size là kích thước file mã hóa, có thể lớn hơn kích thước thật do padding
	esp_loader_error_t err = esp_loader_flash_start(offset, total_size, FLASHER_BUFFER_SIZE);
	if (err != ESP_LOADER_SUCCESS) {
		ESP_LOGE(TAG, "Failed to start flash for encrypted segment. err=%d", err);
		flasher_crypto_cleanup(&crypto);
		fwFile.close();
		return ESP_FAIL;
	}

	// Cấp phát bộ đệm kép (encrypted input, decrypted output)
	uint8_t* buffer_enc = (uint8_t*) malloc(FLASHER_BUFFER_SIZE);
	uint8_t* buffer_dec = (uint8_t*) malloc(FLASHER_BUFFER_SIZE);
	if (!buffer_enc || !buffer_dec) {
		ESP_LOGE(TAG, "Failed to allocate buffers!");
		if (buffer_enc) free(buffer_enc);
		if (buffer_dec) free(buffer_dec);
		flasher_crypto_cleanup(&crypto);
		fwFile.close();
		return ESP_ERR_NO_MEM;
	}

	size_t bytes_written = 0;
	size_t bytes_read = 0;
	uint8_t pkcs7_last_byte = 0;   /* last byte of last decrypted chunk → PKCS7 pad length */

	// Đọc từng khối dữ liệu mã hóa, giải mã và ghi vào flash của Target
	while ((bytes_read = fwFile.read(buffer_enc, FLASHER_BUFFER_SIZE)) > 0) {
		// Giải mã chunk
		size_t dec_len = 0;
		if (flasher_crypto_decrypt(&crypto, buffer_enc, bytes_read, buffer_dec, &dec_len) != ESP_OK) {
			ESP_LOGE(TAG, "Decrypt error at offset %zu", bytes_written);
			break;
		}

		if (dec_len > 0) {
			// Ghi khối dữ liệu đã giải mã vào flash
			err = esp_loader_flash_write(buffer_dec, dec_len);
			if (err != ESP_LOADER_SUCCESS) {
				ESP_LOGE(TAG, "Write error at offset %zu (err=%d)", bytes_written, err);
				break;
			}
			bytes_written += dec_len;
			pkcs7_last_byte = buffer_dec[dec_len - 1];   /* track for padding strip */
		}

		// Tính toán và hiển thị tiến trình nạp
		uint32_t progress = (uint32_t)((bytes_written * 100) / total_size);

		// Cập nhật progress bar (mỗi 2% để giảm flicker)
		static uint32_t last_enc_progress = 0;
		if (progress != last_enc_progress && progress % 10 == 0) {
			last_enc_progress = progress;
			ESP_LOGI(TAG, "Decrypt+Flash: %" PRIu32 "%%", progress);
			// Hiển thị progress bar với icon khóa
			String title = String("") + file_path.c_str();
			ui.showProgress(title.c_str(), (int)progress);
		}
	}

	// Strip PKCS7 padding: last byte of final chunk = padding length.
	// MD5 verify must use the original binary size (without padding).
	if (pkcs7_last_byte >= 1 && pkcs7_last_byte <= 16 && pkcs7_last_byte <= bytes_written) {
		bytes_written -= pkcs7_last_byte;
		ESP_LOGI(TAG, "PKCS7 stripped %u bytes → actual binary: %zu bytes",
		         (unsigned)pkcs7_last_byte, bytes_written);
	} else if (pkcs7_last_byte != 0) {
		ESP_LOGW(TAG, "Unexpected PKCS7 last byte=%u, skipping strip", (unsigned)pkcs7_last_byte);
	}

	// Dọn dẹp
	free(buffer_enc);
	free(buffer_dec);
	flasher_crypto_cleanup(&crypto);
	fwFile.close();

	ESP_LOGI(TAG, "Encrypted segment written %zu bytes OK", bytes_written);

	// --- KIỂM TRA MD5 (NẾU CÓ) ---
	// MD5 phải là hash của binary gốc (raw, không có PKCS7 padding)
	if (md5.length() == 32) {
		char md5_ascii[33];
		strncpy(md5_ascii, md5.c_str(), 32);
		md5_ascii[32] = '\0';

		err = esp_loader_flash_verify_known_md5(offset, bytes_written, (const uint8_t*) md5_ascii);
		if (err != ESP_LOADER_SUCCESS) {
			ESP_LOGE(TAG, "MD5 check failed for encrypted segment!");
			return ESP_FAIL;
		}
		ESP_LOGI(TAG, "MD5 verified OK for encrypted segment!");
	} else {
		ESP_LOGW(TAG, "No valid MD5 provided, skipping verification.");
	}

	ESP_LOGI(TAG, "Encrypted segment at 0x%08" PRIx32 " written successfully.", offset);
	return ESP_OK;
}

/**
 * @brief Bắt đầu toàn bộ phiên nạp firmware: kết nối, nạp 3 phân vùng, và reset.
 * @param fw_id ID của firmware (dùng để tìm metadata file).
 * @return ESP_OK nếu toàn bộ quá trình thành công.
 */
esp_err_t flasher_begin_session(const std::string& fw_id)
{
	firmware_metadata_t metadata;

	// --- BƯỚC 1: LẤY THÔNG TIN FILE TỪ SD CARD ---
	// Lấy đường dẫn và MD5 của bootloader, partition table và app
	esp_err_t ret = sd_get_firmware_path(fw_id, metadata);
	if (ret != ESP_OK) {
		ESP_LOGE(TAG, "Failed to get firmware metadata for fw_id: %s", fw_id.c_str());
		return ret;
	}

