phucttp/sd-flash-esp32/main/flasher/flasher_esp.cpp
	if (try_connect() != ESP_OK) {
		ESP_LOGE(TAG, "Failed to connect to target.");
		ui.showMessage("Flash Session", "connect failed.");
		vTaskDelay(pdMS_TO_TICKS(500));
		return ESP_FAIL;
	} else {
		ESP_LOGI(TAG, "Connected to target successfully.");
		ui.showMessage("Flash Session", "connected.");
	}

	// --- BƯỚC 3: BOOST BAUDRATE ---
	uint32_t new_baud = 921600; // Tăng tốc lên 921600bps
	// Gửi lệnh thay đổi baudrate đến target
	esp_loader_error_t err_baud = esp_loader_change_transmission_rate(new_baud);
	if (err_baud == ESP_LOADER_SUCCESS) {
		// Nếu target chấp nhận, host (ESP32-C3) cũng phải thay đổi baudrate UART
		uart_set_baudrate(UART_NUM_1, new_baud);
		ESP_LOGI(TAG, "Baudrate boosted to %lu", new_baud);
	} else {
		ESP_LOGW(TAG, "Baudrate boost failed (err=%d), continue at 115200", err_baud);
	}


	// --- BƯỚC 4: GHI TỪNG PHÂN VÙNG THEO THỨ TỰ ---
	// Chọn hàm flash dựa trên flag encrypted
	if (metadata.encrypted) {
		ESP_LOGI(TAG, ">>> ENCRYPTED FLASH MODE <<<");
		ui.showMessage("Flash Mode", "ENCRYPTED");
		vTaskDelay(pdMS_TO_TICKS(500));

		// 4a. Nạp bootloader mã hóa (Offset: 0x1000)
		ret = flasher_write_segment_encrypted(metadata.path_bootloader, ESP_BOOTLOADER_ADDR, metadata.md5_bootloader);
		if (ret != ESP_OK) return ret;

		// 4b. Nạp partition table mã hóa (Offset: 0x8000)
		ret = flasher_write_segment_encrypted(metadata.path_partition, ESP_PARTITION_ADDR, metadata.md5_partition);
		if (ret != ESP_OK) return ret;

		// 4c. Nạp firmware chính mã hóa (Offset: 0x10000)
		ret = flasher_write_segment_encrypted(metadata.path, ESP_APPLICATION_ADDR, metadata.md5);
		if (ret != ESP_OK) return ret;
	} else {
		ESP_LOGI(TAG, ">>> PLAIN FLASH MODE <<<");

		// 4a. Nạp bootloader (Offset: 0x1000)
		ret = flasher_write_segment(metadata.path_bootloader, ESP_BOOTLOADER_ADDR, metadata.md5_bootloader);
		if (ret != ESP_OK) return ret;

		// 4b. Nạp partition table (Offset: 0x8000)
		ret = flasher_write_segment(metadata.path_partition, ESP_PARTITION_ADDR, metadata.md5_partition);
		if (ret != ESP_OK) return ret;

		// 4c. Nạp firmware chính (Offset: 0x10000)
		ret = flasher_write_segment(metadata.path, ESP_APPLICATION_ADDR, metadata.md5);
		if (ret != ESP_OK) return ret;
	}

	// --- BƯỚC 5: RESET TARGET VỀ CHẾ ĐỘ THƯỜNG ---
	esp_loader_reset_target();
	ESP_LOGI(TAG, "Resetting target to run app...");
	vTaskDelay(pdMS_TO_TICKS(200));

	ESP_LOGI(TAG, "Target restarted in normal mode.");
	ESP_LOGI(TAG, "Full firmware update completed successfully!");

	// NOTE: Không gọi host_system_restart() ở đây nữa
	// Để action_flash_firmware() return ESP_OK về handleTabSelection()
	// handleTabSelection() sẽ gọi host_system_restart(tab, item_id) với state save
	return ESP_OK;
}


/**
 * @brief Reset sequence kiểu esptool - brute force thử tất cả logic combinations
 * @param config Cấu hình GPIO
 * @param reset_invert 0=direct (LOW=LOW), 1=transistor (HIGH=LOW)
 * @param boot_invert 0=direct (LOW=LOW), 1=transistor (HIGH=LOW)
 */
static void do_reset_sequence(const loader_esp32_config_t *config, int reset_invert, int boot_invert, uint32_t reset_ms, uint32_t boot_ms)
{
	int reset_active = reset_invert ? 1 : 0;
	int reset_idle = reset_invert ? 0 : 1;
	int boot_active = boot_invert ? 1 : 0;
	int boot_idle = boot_invert ? 0 : 1;

	// Step 1: Set GPIO0 to boot mode (active = LOW on target)
	gpio_set_level((gpio_num_t)config->gpio0_trigger_pin, boot_active);
	vTaskDelay(pdMS_TO_TICKS(50));

	// Step 2: Pulse reset
	gpio_set_level((gpio_num_t)config->reset_trigger_pin, reset_active);  // EN = LOW
	vTaskDelay(pdMS_TO_TICKS(reset_ms));
	gpio_set_level((gpio_num_t)config->reset_trigger_pin, reset_idle);    // EN = HIGH

	// Step 3: Hold GPIO0 for boot sampling
	vTaskDelay(pdMS_TO_TICKS(boot_ms));

	// Step 4: Release GPIO0
	gpio_set_level((gpio_num_t)config->gpio0_trigger_pin, boot_idle);
}

/**
 * @brief Brute force try tất cả GPIO logic combinations như esptool
 * @return ESP_OK nếu kết nối thành công
 */
static esp_err_t try_all_reset_combinations(const loader_esp32_config_t *config)
{
	gpio_set_direction((gpio_num_t)config->gpio0_trigger_pin, GPIO_MODE_OUTPUT);
	gpio_set_direction((gpio_num_t)config->reset_trigger_pin, GPIO_MODE_OUTPUT);

	esp_loader_connect_args_t connect_config = ESP_LOADER_CONNECT_DEFAULT();

	// 4 combinations: (reset_invert, boot_invert)
	// 0,0 = both direct
	// 0,1 = reset direct, boot transistor
	// 1,0 = reset transistor, boot direct
	// 1,1 = both transistor
	const int combinations[4][2] = {
		{1, 1},  // Both transistor (most common for autoboot boards)
		{1, 0},  // Reset transistor, Boot direct
		{0, 1},  // Reset direct, Boot transistor
		{0, 0},  // Both direct
	};
	const char* combo_names[4] = {
		"RST=inv, BOOT=inv",
		"RST=inv, BOOT=dir",
		"RST=dir, BOOT=inv",
		"RST=dir, BOOT=dir",
	};

	// Timing variations
	const uint32_t timings[3][2] = {
		{100, 50},   // Fast
		{100, 100},  // Normal
		{200, 200},  // Slow
	};

	// Animation: spinning chars + attempt counter
	const char spinner[] = "|/-\\";
	int attempt = 0;
	const int totalAttempts = 12;  // 3 timings x 4 combos

	for (int t = 0; t < 3; t++) {
		for (int c = 0; c < 4; c++) {
			attempt++;

			// [ANIMATION] Hiển thị tiến trình kết nối
			char line1[22];
			char line2[22];
			snprintf(line1, sizeof(line1), "Connecting %c", spinner[attempt % 4]);
			snprintf(line2, sizeof(line2), "Try %d/%d...", attempt, totalAttempts);
			ui.showMessage(line1, line2);

			ESP_LOGI(TAG, "Trying [%d/%d]: %s, timing=%lu/%lu ms",
			         attempt, totalAttempts, combo_names[c], timings[t][0], timings[t][1]);

			// Release all first
			gpio_set_level((gpio_num_t)config->gpio0_trigger_pin, combinations[c][1] ? 0 : 1);
			gpio_set_level((gpio_num_t)config->reset_trigger_pin, combinations[c][0] ? 0 : 1);
			vTaskDelay(pdMS_TO_TICKS(100));

			// Do reset sequence
			do_reset_sequence(config, combinations[c][0], combinations[c][1],
			                  timings[t][0], timings[t][1]);

			// Flush UART
			uart_flush(config->uart_port);
			uart_flush_input(config->uart_port);
			vTaskDelay(pdMS_TO_TICKS(50));

			// Try connect
			if (esp_loader_connect(&connect_config) == ESP_LOADER_SUCCESS) {
				ESP_LOGI(TAG, "SUCCESS! Working combination: %s, timing=%lu/%lu",
				         combo_names[c], timings[t][0], timings[t][1]);
				ui.showMessage("Connected!", "Success");
				return ESP_OK;
			}

			ESP_LOGW(TAG, "Failed, trying next...");
			vTaskDelay(pdMS_TO_TICKS(100));
		}
	}

	ESP_LOGE(TAG, "All combinations failed!");
	return ESP_FAIL;
}

/**
 * @brief Xóa toàn bộ flash của chip Target.
 * @return ESP_OK nếu xóa thành công.
 */
esp_err_t flasher_chip_erase() {
	ESP_LOGI(TAG, "--- START CHIP ERASE ---");

	// 1. Handshake với Target (tự động thử các timing profiles)
	if (try_connect() != ESP_OK) {
		ESP_LOGE(TAG, "Failed to connect to target for erase.");
		ui.showMessage("Erasing Chip", "failed to connect.");
		return ESP_FAIL;
	}
	ESP_LOGI(TAG, "Connected. Erasing chip (please wait)...");
	ui.showMessage("Erasing Chip", "connected.");

