phucttp/sd-flash-esp32/main/flasher/flasher_esp.cpp
	// 2. Gọi lệnh xóa toàn bộ (Hàm này sẽ BLOCK cho đến khi xóa xong, có thể mất vài giây)
	ui.showMessage("Erasing Chip", "erasing...");
	esp_loader_error_t err = esp_loader_flash_erase();
	if (err != ESP_LOADER_SUCCESS) {
		ESP_LOGE(TAG, "Chip erase failed with error: %d", err);
		ui.showMessage("Erasing Chip", "erase failed!");
		return ESP_FAIL;
	}

	ESP_LOGI(TAG, "Chip erase completed successfully!");
	ui.showMessage("Erasing Chip", "SUCCESS!");

	// 3. Reset target lại để target chạy lại app (hoặc chỉ chạy bootloader nếu chưa có app)
	esp_loader_reset_target();

	// NOTE: Không gọi host_system_restart() ở đây nữa
	// Để action_erase_chip() return ESP_OK về handleTabSelection()
	// handleTabSelection() sẽ gọi host_system_restart(tab, item_id) với state save
	return ESP_OK;
}

// ============================================================
// SCAN BOOT API - Save/Load boot combo config
// ============================================================

/**
 * @brief Lưu combo index vào file trên SD
 */
static void save_combo_to_sd(int combo_index) {
	// Tạo thư mục config nếu chưa có
	if (!SD.exists("/config")) {
		SD.mkdir("/config");
	}

	File f = SD.open(BOOT_CONFIG_PATH, FILE_WRITE);
	if (f) {
		f.printf("%d\n", combo_index);
		f.close();
		ESP_LOGI(TAG, "Saved boot combo #%d to SD", combo_index);
		g_saved_combo = combo_index;
		g_combo_loaded = true;
	} else {
		ESP_LOGE(TAG, "Failed to save boot config to SD");
	}
}

/**
 * @brief Load combo index từ file trên SD
 */
int flasher_load_saved_combo(void) {
	if (g_combo_loaded) {
		return g_saved_combo;
	}

	if (!SD.exists(BOOT_CONFIG_PATH)) {
		ESP_LOGI(TAG, "No saved boot config found");
		g_saved_combo = -1;
		g_combo_loaded = true;
		return -1;
	}

	File f = SD.open(BOOT_CONFIG_PATH, FILE_READ);
	if (!f) {
		ESP_LOGE(TAG, "Failed to open boot config");
		g_saved_combo = -1;
		g_combo_loaded = true;
		return -1;
	}

	String line = f.readStringUntil('\n');
	f.close();

	int combo = line.toInt();
	if (combo >= 0 && combo < 12) {
		ESP_LOGI(TAG, "Loaded saved boot combo #%d", combo);
		g_saved_combo = combo;
	} else {
		ESP_LOGW(TAG, "Invalid combo value in config: %d", combo);
		g_saved_combo = -1;
	}
	g_combo_loaded = true;
	return g_saved_combo;
}

/**
 * @brief Xóa combo đã lưu
 */
void flasher_clear_saved_combo(void) {
	if (SD.exists(BOOT_CONFIG_PATH)) {
		SD.remove(BOOT_CONFIG_PATH);
		ESP_LOGI(TAG, "Cleared saved boot config");
	}
	g_saved_combo = -1;
	g_combo_loaded = true;
}

/**
 * @brief Thử kết nối với combo cụ thể
 * @param combo_index Index combo (0-11)
 * @return ESP_OK nếu thành công
 */
static esp_err_t try_connect_with_combo(int combo_index) {
	const int combinations[4][2] = {
		{1, 1}, {1, 0}, {0, 1}, {0, 0}
	};
	const uint32_t timings[3][2] = {
		{100, 50}, {100, 100}, {200, 200}
	};

	int t = combo_index / 4;  // timing index (0-2)
	int c = combo_index % 4;  // combo index (0-3)

	gpio_set_direction((gpio_num_t)config.gpio0_trigger_pin, GPIO_MODE_OUTPUT);
	gpio_set_direction((gpio_num_t)config.reset_trigger_pin, GPIO_MODE_OUTPUT);

	ESP_LOGI(TAG, "Trying saved combo #%d (timing=%lu/%lu)",
	         combo_index, timings[t][0], timings[t][1]);

	// Release all first
	gpio_set_level((gpio_num_t)config.gpio0_trigger_pin, combinations[c][1] ? 0 : 1);
	gpio_set_level((gpio_num_t)config.reset_trigger_pin, combinations[c][0] ? 0 : 1);
	vTaskDelay(pdMS_TO_TICKS(100));

	// Do reset sequence
	do_reset_sequence(&config, combinations[c][0], combinations[c][1],
	                  timings[t][0], timings[t][1]);

	// Flush UART
	uart_flush(config.uart_port);
	uart_flush_input(config.uart_port);
	vTaskDelay(pdMS_TO_TICKS(50));

	// Try connect
	esp_loader_connect_args_t connect_config = ESP_LOADER_CONNECT_DEFAULT();
	if (esp_loader_connect(&connect_config) == ESP_LOADER_SUCCESS) {
		ESP_LOGI(TAG, "Connected with saved combo #%d!", combo_index);
		return ESP_OK;
	}

	return ESP_FAIL;
}

/**
 * @brief Scan tất cả combo và lưu combo working
 */
int flasher_scan_and_save_combo(void) {
	gpio_set_direction((gpio_num_t)config.gpio0_trigger_pin, GPIO_MODE_OUTPUT);
	gpio_set_direction((gpio_num_t)config.reset_trigger_pin, GPIO_MODE_OUTPUT);

	esp_loader_connect_args_t connect_config = ESP_LOADER_CONNECT_DEFAULT();

	const int combinations[4][2] = {
		{1, 1}, {1, 0}, {0, 1}, {0, 0}
	};
	const char* combo_names[4] = {
		"RST=inv,BOOT=inv",
		"RST=inv,BOOT=dir",
		"RST=dir,BOOT=inv",
		"RST=dir,BOOT=dir"
	};
	const uint32_t timings[3][2] = {
		{100, 50}, {100, 100}, {200, 200}
	};

	const char spinner[] = "|/-\\";
	int attempt = 0;
	const int totalAttempts = 12;

	for (int t = 0; t < 3; t++) {
		for (int c = 0; c < 4; c++) {
			int combo_index = t * 4 + c;
			attempt++;

			// Animation
			char line1[22];
			char line2[22];
			snprintf(line1, sizeof(line1), "Scanning %c", spinner[attempt % 4]);
			snprintf(line2, sizeof(line2), "Try %d/%d...", attempt, totalAttempts);
			ui.showMessage(line1, line2);

			ESP_LOGI(TAG, "Scan [%d/%d]: %s, timing=%lu/%lu",
			         attempt, totalAttempts, combo_names[c], timings[t][0], timings[t][1]);

			// Release all first
			gpio_set_level((gpio_num_t)config.gpio0_trigger_pin, combinations[c][1] ? 0 : 1);
			gpio_set_level((gpio_num_t)config.reset_trigger_pin, combinations[c][0] ? 0 : 1);
			vTaskDelay(pdMS_TO_TICKS(100));

			do_reset_sequence(&config, combinations[c][0], combinations[c][1],
			                  timings[t][0], timings[t][1]);

			uart_flush(config.uart_port);
			uart_flush_input(config.uart_port);
			vTaskDelay(pdMS_TO_TICKS(50));

			if (esp_loader_connect(&connect_config) == ESP_LOADER_SUCCESS) {
				ESP_LOGI(TAG, "FOUND! Combo #%d: %s, timing=%lu/%lu",
				         combo_index, combo_names[c], timings[t][0], timings[t][1]);

				// Lưu combo vào SD
				save_combo_to_sd(combo_index);

				ui.showMessage("FOUND!", line2);
				vTaskDelay(pdMS_TO_TICKS(500));

				// Reset target để thoát bootloader
				esp_loader_reset_target();

				return combo_index;
			}

			vTaskDelay(pdMS_TO_TICKS(100));
		}
	}

