phucttp/sd-flash-esp32/main/flasher/flasher_esp.cpp
	ESP_LOGE(TAG, "Scan failed - no working combo found!");
	return -1;
}

/**
 * @brief Special connect: nhả BOOT trước EN — hardware-verified.
 *
 * Khác với brute-force: cả BOOT và EN bị kéo xuống cùng lúc, sau đó BOOT
 * được nhả lên TRƯỚC khi EN đi lên. ROM ESP32 sample chân BOOT ngay cạnh
 * sườn lên của EN, nên sequence này đảm bảo target vào bootloader mode.
 */
static esp_err_t try_connect_special(void)
{
	gpio_set_direction((gpio_num_t)config.gpio0_trigger_pin, GPIO_MODE_OUTPUT);
	gpio_set_direction((gpio_num_t)config.reset_trigger_pin, GPIO_MODE_OUTPUT);

	ESP_LOGI(TAG, "=== SPECIAL CONNECT (Early BOOT release) ===");
	ui.showMessage("Connecting...", "Special mode...");

	// 1. Kéo cả BOOT và EN (Reset) xuống mức 0 cùng lúc
	gpio_set_level((gpio_num_t)config.gpio0_trigger_pin, 1);
	gpio_set_level((gpio_num_t)config.reset_trigger_pin, 0);

	// 2. Chờ 100ms để điện áp tụt hẳn, xả sạch tụ trên mạch
	vTaskDelay(pdMS_TO_TICKS(100));

	// 3. ĐIỂM ĂN TIỀN: Nhả chân BOOT lên 1 TRƯỚC
	gpio_set_level((gpio_num_t)config.gpio0_trigger_pin, 0);

	// 4. Nhả chân EN lên 1 NGAY LẬP TỨC sát nút
	gpio_set_level((gpio_num_t)config.reset_trigger_pin, 1);

	// 5. Chờ 100ms cho chip khởi động và yên vị trong Bootloader
	vTaskDelay(pdMS_TO_TICKS(100));

	uart_flush(config.uart_port);
	uart_flush_input(config.uart_port);

	esp_loader_connect_args_t connect_config = ESP_LOADER_CONNECT_DEFAULT();
	if (esp_loader_connect(&connect_config) == ESP_LOADER_SUCCESS) {
		ESP_LOGI(TAG, "SPECIAL CONNECT success!");
		ui.showMessage("Connected!", "Special mode");
		return ESP_OK;
	}

	ESP_LOGW(TAG, "Special connect failed.");
	return ESP_FAIL;
}

static esp_err_t try_connect(void) {
	// --- ƯU TIÊN: Thử saved combo trước ---
	int saved = flasher_load_saved_combo();
	if (saved >= 0) {
		ESP_LOGI(TAG, "=== FAST CONNECT (saved combo #%d) ===", saved);
		ui.showMessage("Connecting...", "Using saved cfg");

		if (try_connect_with_combo(saved) == ESP_OK) {
			ui.showMessage("Connected!", "Fast mode");
			vTaskDelay(pdMS_TO_TICKS(300));
			return ESP_OK;
		}

		// Saved combo failed -> clear và thử special + brute force
		ESP_LOGW(TAG, "Saved combo failed, clearing...");
		flasher_clear_saved_combo();
	}

	// --- SPECIAL: Early BOOT release sequence ---
	if (try_connect_special() == ESP_OK) {
		vTaskDelay(pdMS_TO_TICKS(300));
		return ESP_OK;
	}

	// --- BRUTE FORCE: Thử tất cả GPIO logic combinations ---
	ESP_LOGI(TAG, "=== BRUTE FORCE CONNECT (esptool style) ===");

	esp_err_t result = try_all_reset_combinations(&config);

	if (result == ESP_OK) {
		vTaskDelay(pdMS_TO_TICKS(300));  // Cho user thấy "Connected!"
		return ESP_OK;
	} else {
		ESP_LOGE(TAG, "All reset combinations failed!");
		ui.showMessage("FAILED!", "Check wiring");
		vTaskDelay(pdMS_TO_TICKS(1500));
		return ESP_FAIL;
	}
}